{
  "id": "2",
  "title": "Jeu du Kem's en Système Réparti",
  "description": "À l'Université de Technologie de Compiègne (UTC), les étudiants réalisent divers projets pour appliquer les notions vues en cours. Les étudiants de la filière Ingénierie des Systèmes d'Information (ISI) ont développé, dans le cadre du cours de systèmes répartis, un jeu de Kem's.",
  "imageUrl": "/projects/2/images/kemsBanner.png",
  "tags": ["distributed systems", "game development", "ISI"],
  "startDate": "2024-08-17T00:00:00Z",
  "endDate": "2024-08-20T00:00:00Z",
  "members": [],
  "sections": [
    {
      "title": "Introduction",
      "content": "À l'Université de Technologie de Compiègne (UTC), les étudiants réalisent divers projets pour appliquer les notions vues en cours. Les étudiants de la filière Ingénierie des Systèmes d'Information (ISI) ont développé, dans le cadre du cours de systèmes répartis, un jeu de Kem's."
    },
    {
      "title": "Introduction aux Systèmes Répartis",
      "content": "Une application d'un système réparti peut être vulgarisée comme un algorithme qui fonctionne sur plusieurs sites séparés géographiquement mais communiquant entre eux. Imaginez les armées romaines sur un front : pour que les différentes légions puissent fonctionner efficacement, elles doivent communiquer pour transmettre les ordres, demander des renforts et connaître l'état des troupes. De la même manière, un système réparti permet à plusieurs ordinateurs de collaborer pour accomplir une tâche commune tout en étant éloignés les uns des autres.",
      "mediaUrls": ["/projects/2/images/campRomain.png"]
    },
    {
      "title": "Systèmes Répartis et Fonctionnement d'Internet",
      "content": "Les systèmes répartis sont essentiels pour le fonctionnement de l'internet. Chaque site web que vous visitez, chaque e-mail que vous envoyez, et chaque vidéo que vous regardez impliquent des ordinateurs qui travaillent ensemble à travers le monde. Les données sont envoyées et reçues de manière fiable grâce à des protocoles de communication sophistiqués. Cela permet à l'internet de fonctionner de manière fluide et efficace, même si les serveurs sont situés dans des endroits différents.",
      "mediaUrls": ["/projects/2/images/internet.png"]
    },
    {
      "title": "Implémentation du Jeu du Kem's en Système Réparti",
      "content": "Nos étudiants ont mis en pratique ces notions complexes en développant un jeu du Kem's réparti. Le Kem's est un jeu de cartes où chaque joueur joue de manière spontanée, sans tours de jeu fixes. Une application répartie doit synchroniser les données partagées du jeu de cartes pour éviter les duplications de cartes ou les erreurs. Cela implique de gérer la communication entre les différentes instances de l'application sur plusieurs appareils, garantissant ainsi une expérience de jeu fluide et sans accroc.",
      "mediaUrls": ["/projects/2/images/kemsInterface.png"]
    }
  ]
}
